app/controllers/passages_controller.rb

  def index
    @passages = Passage.all
---
SELECT "passages".* FROM "passages"

  def show
    if params[:id] then
      @passage = Passage.find(params[:id])
---
SELECT "passages".* FROM "passages" WHERE "passages"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @passage = Passage.find(params[:id])
---
SELECT "passages".* FROM "passages" WHERE "passages"."id" = $1 LIMIT 1  [["id", "1"]]