app/views/passages/show.html.haml

  %b content:
  - @passage.phrases.each do |phrase|
---
SELECT "phrases".* FROM "phrases" WHERE "phrases"."passage_id" = 1